In [2]:
import pandas as pd

In [3]:
data = pd.read_csv("./evolver_2016_scores.csv")

In [4]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 41149 entries, 0 to 41148
Data columns (total 1 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   3874    41149 non-null  int64
dtypes: int64(1)
memory usage: 321.6 KB

In [5]:
data.describe()

               3874
count  41149.000000
mean       2.431772
std       74.044178
min        0.000000
25%        0.000000
50%        0.000000
75%        0.000000
max     3838.000000

In [8]:
data["3874"].unique()

array([3838, 3719, 3678, 3624, 3593, 3519, 3497, 3155, 3024, 2895, 2835,
       2768, 2748, 2649, 2430, 2220, 2104, 2075, 2054, 2046, 2018, 1944,
       1933, 1905, 1822, 1821, 1813, 1590, 1524, 1374, 1309, 1195, 1170,
       1099, 1007,  950,  884,  802,  776,  746,  660,  608,  573,  533,
        492,  477,  418,  413,  407,  386,  376,  369,  338,  304,  303,
        302,  278,  270,  266,  257,  255,  239,  237,  234,  228,  208,
        187,  183,  171,  156,  137,  135,  128,  118,  108,  100,   90,
         88,   62,   57,   55,   50,   49,   47,   46,   44,   43,   42,
         37,    0,   35,   34,   33,   32,   30], dtype=int64)

In [12]:
data.head(19)

    3874
0   3838
1   3719
2   3678
3   3624
4   3593
5   3519
6   3497
7   3155
8   3024
9   2895
10  2835
11  2768
12  2748
13  2649
14  2430
15  2220
16  2104
17  2075
18  2054

In [12]:
data["3874"].value_counts()

0       41045
950         2
46          2
266         2
369         2
        ...
1374        1
1524        1
1590        1
1813        1
30          1
Name: 3874, Length: 95, dtype: int64

In [13]:
data["3874"] == 0

0        False
1        False
2        False
3        False
4        False
         ...
41144     True
41145     True
41146     True
41147     True
41148     True
Name: 3874, Length: 41149, dtype: bool

In [15]:
data["3874"].unique()

array([3838, 3719, 3678, 3624, 3593, 3519, 3497, 3155, 3024, 2895, 2835,
       2768, 2748, 2649, 2430, 2220, 2104, 2075, 2054, 2046, 2018, 1944,
       1933, 1905, 1822, 1821, 1813, 1590, 1524, 1374, 1309, 1195, 1170,
       1099, 1007,  950,  884,  802,  776,  746,  660,  608,  573,  533,
        492,  477,  418,  413,  407,  386,  376,  369,  338,  304,  303,
        302,  278,  270,  266,  257,  255,  239,  237,  234,  228,  208,
        187,  183,  171,  156,  137,  135,  128,  118,  108,  100,   90,
         88,   62,   57,   55,   50,   49,   47,   46,   44,   43,   42,
         37,    0,   35,   34,   33,   32,   30], dtype=int64)

In [16]:
data[data["3874"] == 0]

       3874
99        0
100       0
101       0
102       0
103       0
...     ...
41144     0
41145     0
41146     0
41147     0
41148     0

[41045 rows x 1 columns]